class TestData:
    REG_DATA_USER1_1 = ['Джессика', 'Вайт', 'улица Мира, дом 18', 'Славянский бульвар',
                        '+71111111111']  # регистрационный набор данных юзера 1, 1ая часть
    REG_DATA_USER1_2 = ['23.06.2024',
                        'Позвоните за час до доставки, пожалуйста']  # регистрационный набор данных юзера 1, 2ая часть
    REG_DATA_USER2_1 = ['Энтони', 'Блу', 'бульвар Ломоносова, дом 18', 'Крылатское',
                        '+70000000000']  # регистрационный набор данных юзера 2, 1ая часть
    REG_DATA_USER2_2 = ['25.06.2024',
                        'Около нашего дома стоит забор с домофоном, код 123']  # регистрационный набор данных юзера 2, 2ая часть

    # список ответов на часто задаваемые вопросы
    FAQ_QUESTIONS_AND_ANSWERS = [
        [1, 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'],
        [2,
         'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'],
        [3,
         'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'],
        [4, 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'],
        [5, 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'],
        [6,
         'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'],
        [7, 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'],
        [8, 'Да, обязательно. Всем самокатов! И Москве, и Московской области.']
    ]

    HOME_URL = 'https://qa-scooter.praktikum-services.ru/'  # хоум страница
    DZEN_URL = 'https://dzen.ru/?yredirect=true&is_autologin_ya=true'  # страница редиректа на дзен
    BASE_URL = 'https://qa-scooter.praktikum-services.ru/' #главная страница портала
